# Dictionaries and Dataframes

Now that we've learned some Python basics, we'll move to applying our tools to do more sophisticated data analyses. To do so, we often don't want lists, but we want certain elements to be associated with values. A person will have an income, for example, or a novel will use the word `humanistic` a certain number of times. Today we'll think through data types that can help us we these associations.

## Learning Goals
* Learn about dictionaries, tuples, and dataframes
* Get comfortable with manipulating them, and slicing them
* Think through how we might use them for data analysis (more on this to come!)

# Part 1: Dictionaries

Like lists, dictionaries can easily be changed, can be shrunk and grown ad libitum at run time. They shrink and grow without the necessity of making copies. Dictionaries can be contained in lists and vice versa. 

But what's the difference between lists and dictionaries? Lists are ordered sets of objects, whereas dictionaries are unordered sets. But the main difference is that items in dictionaries are accessed via keys and not via their position. A dictionary is an associative array (also known as hashes). Any key of the dictionary is associated (or mapped) to a value. The values of a dictionary can be any Python data type. So dictionaries are unordered key-value-pairs.

In [11]:
my_tuple = [('education', 'high school'), ('income', 100),("gender","male")]
my_dict = dict(my_tuple)
type(my_dict)

dict

In [13]:
my_tuple = [('education', 'high school'), ('income', 100)]

In [14]:
my_tuple[1][1]

100

In [15]:
my_dict = dict(my_tuple)

In [16]:
my_dict

{'education': 'high school', 'income': 100}

The key is before the colon, the value is after the colon. 

Find all the keys from the dictionary, and then all the values.

In [17]:
my_dict.keys()

dict_keys(['education', 'income'])

In [18]:
my_dict.values()

dict_values(['high school', 100])

We can access keys using the bracket syntax. We've seen this before. The input is a dictionary key, the output is the key's value.

In [19]:
my_dict['education']

'high school'

In [20]:
my_dict['income']

100

We can add key/value pairs using the bracket syntax and the assignment operator. Notice the order of the key/value pairs does not matter, like they do in lists and strings.

In [23]:
my_dict['age'] = 24
my_dict

{'education': 'high school', 'income': 100, 'age': 24}

# Part 2: Pandas

<i>Pandas</i> is a popular and flexible package whose primary use is its datatype: the <i>DataFrame</i>. The dataframe is essentially a spreadsheet, like you would find in Excel, but it has some tricks up its sleeve!

As we will see, Pandas allows us to do basic statistics easily, allows us to compare columns, and allows us to do quick and easy visualizations. 

We will practice these uses of Pandas in the next three weeks. Today, I'm just planting the seed. We can easily transform lists of tuples, or lists of dictionaries, into a Pandas dataframe using the `pandas.DataFrame` method.

In [24]:
#get ready! import the pandas libarary
import pandas

In [25]:
#create a list of dictionaries, starting with the original dictionary, my_dict
df_list = []
my_dict

{'education': 'high school', 'income': 100, 'age': 24}

In [26]:
df_list.append(my_dict)
df_list

[{'education': 'high school', 'income': 100, 'age': 24}]

In [27]:
df_list.extend([{'age': 22, 'education': 'BA', 'income': 400}, {'age': 35, 'education': 'MA', 'income': 700}])
df_list

[{'education': 'high school', 'income': 100, 'age': 24},
 {'age': 22, 'education': 'BA', 'income': 400},
 {'age': 35, 'education': 'MA', 'income': 700}]

In [28]:
df = pandas.DataFrame(df_list)
df

     education  income  age
0  high school     100   24
1           BA     400   22
2           MA     700   35

In [29]:
#we can do the same but add row name, if we'd like
row_names = ['Prof. Nelson', 'Prof. Handel', 'Prof. Blum']
df = pandas.DataFrame(df_list, index=row_names)
df

                education  income  age
Prof. Nelson  high school     100   24
Prof. Handel           BA     400   22
Prof. Blum             MA     700   35

What can we do with this? A lot! Today we'll subset, slice, and do some basic arithmetic. We'll practice more with it in the coming weeks.

In [30]:
# Call up a column of the dataframe

df['income']

Prof. Nelson    100
Prof. Handel    400
Prof. Blum      700
Name: income, dtype: int64

In [31]:
# Call up a row from the indices
df.iloc[1]

education     BA
income       400
age           22
Name: Prof. Handel, dtype: object

In [32]:
#do the same using the name, but notice the syntax here
df.loc['Prof. Handel']

education     BA
income       400
age           22
Name: Prof. Handel, dtype: object

In [33]:
# Call up a couple of rows, using a list of indices

df.loc[['Prof. Nelson','Prof. Blum']]

                education  income  age
Prof. Nelson  high school     100   24
Prof. Blum             MA     700   35

In [34]:
# Get a specific entry by calling both row and column

df.loc['Prof. Nelson']['income']

100

In [35]:
# Who has the highest income?
#Temporarily re-order the dataframe by values in the 'income' column

df.sort_values('income', ascending=False)

                education  income  age
Prof. Blum             MA     700   35
Prof. Handel           BA     400   22
Prof. Nelson  high school     100   24

In [36]:
df_high_income = df.sort_values('income', ascending=False)

In [37]:
df_high_income

                education  income  age
Prof. Blum             MA     700   35
Prof. Handel           BA     400   22
Prof. Nelson  high school     100   24

In [38]:
# Create a new column

df['gender'] = ['f','m','f']

In [39]:
# Inspect

df

                education  income  age gender
Prof. Nelson  high school     100   24      f
Prof. Handel           BA     400   22      m
Prof. Blum             MA     700   35      f

### Exercise 2.1: Call up the entry 400 from the middle of the dataframe 'df'
### Exercise 2.2:  Call up the entry BA from the middle of the dataframe 'df' 
### Exercise 2.3: Call up both entries at the same time

In [40]:
#Exercise code here
df.loc['Prof. Handel']['income']

400

In [42]:
df.iloc[1]['income']

400

In [43]:
df.loc['Prof. Handel']['education']

'BA'

In [44]:
df.iloc[1][0]

'BA'

In [45]:
print(df.loc['Prof. Handel']['income'],df.loc['Prof. Handel']['education'])

400 BA

## DataFrame Subsetting

In [46]:
# Slice out a column

df['income']

Prof. Nelson    100
Prof. Handel    400
Prof. Blum      700
Name: income, dtype: int64

In [48]:
# Evaluate whether each element in the column is equal to 100

df['income']>100

Prof. Nelson    False
Prof. Handel     True
Prof. Blum       True
Name: income, dtype: bool

In [55]:
# We can also use evaluation to subset the table. This time we'll use the greater than evaluator.
df1 = df[df['income']>100]

In [57]:
df1[df1["age"]>30]

           education  income  age gender
Prof. Blum        MA     700   35      f

In [58]:
df[df['gender']=='f']

                education  income  age gender
Prof. Nelson  high school     100   24      f
Prof. Blum             MA     700   35      f

### Exercise 2.4: Slice 'df' to contain only rows in which 'education' equals 'BA'

In [59]:
#Exercise 2.4 code here
df[df['education']=='BA']

             education  income  age gender
Prof. Handel        BA     400   22      m

## Arithmetic! Statistics!

In [60]:
# Our dataframe

df

                education  income  age gender
Prof. Nelson  high school     100   24      f
Prof. Handel           BA     400   22      m
Prof. Blum             MA     700   35      f

In [61]:
# Pandas will produce a few descriptive statistics for each row, but only columns that are numbers

df.describe()

       income   age
count     3.0   3.0
mean    400.0  27.0
std     300.0   7.0
min     100.0  22.0
25%     250.0  23.0
50%     400.0  24.0
75%     550.0  29.5
max     700.0  35.0

In [62]:
# Multiply entries of the dataframe by 10

df_10 = df*10

In [63]:
df_10

,education,income,age,gender
Prof. Nelson,high schoolhigh schoolhigh schoolhigh schoolhi...,1000,240,ffffffffff
Prof. Handel,BABABABABABABABABABA,4000,220,mmmmmmmmmm
Prof. Blum,MAMAMAMAMAMAMAMAMAMA,7000,350,ffffffffff

In [64]:
df

                education  income  age gender
Prof. Nelson  high school     100   24      f
Prof. Handel           BA     400   22      m
Prof. Blum             MA     700   35      f

In [65]:
# Add 10 to each entry

df+10

TypeError: can only concatenate str (not "int") to str

In [68]:
df['education']+' 10'

Prof. Nelson    high school 10
Prof. Handel             BA 10
Prof. Blum               MA 10
Name: education, dtype: object

We can't do it! Why not?

In [71]:
#We can do it if we specify a column

df['income']+10

Prof. Nelson    110
Prof. Handel    410
Prof. Blum      710
Name: income, dtype: int64

In [69]:
df.dtypes

education    object
income        int64
age           int64
gender       object
dtype: object

In [70]:
# Of course our dataframe hasn't changed

df

                education  income  age gender
Prof. Nelson  high school     100   24      f
Prof. Handel           BA     400   22      m
Prof. Blum             MA     700   35      f

In [72]:
# What if we just want to add the values in the column?

df['income'].sum()

1200

In [73]:
# We can also perform operations among columns
# Pandas knows to match up individual entries in each column

df['income/age'] = df['income']/df['age']
df

                education  income  age gender  income/age
Prof. Nelson  high school     100   24      f    4.166667
Prof. Handel           BA     400   22      m   18.181818
Prof. Blum             MA     700   35      f   20.000000

In [74]:
income_age_2 = [100/24,400/22,700/35]

In [75]:
income_age_2

[4.166666666666667, 18.181818181818183, 20.0]

In [76]:
df['i/a_2']=income_age_2

In [77]:
df

                education  income  age gender  income/age      i/a_2
Prof. Nelson  high school     100   24      f    4.166667   4.166667
Prof. Handel           BA     400   22      m   18.181818  18.181818
Prof. Blum             MA     700   35      f   20.000000  20.000000

### Exercise 2.5: `.sum()` adds the values in a column. `.mean()` calculates the mean value in a column.
### Find the mean income and the mean age for the dataframe `df`

In [78]:
#Exercise 2.5 code here
df['age'].mean()

27.0

## Part 3: Summarzing quantitative data

The data is a .csv file called `MLS_salary_data.csv` you should download from the `data` folder on Blackboard and save in your 'data' folder on your computer. This dataset contains the salaries of Major League Soccer players between 2007 and 2016. You can find information on the dataset [here](https://www.kaggle.com/crawford/us-major-league-soccer-salaries).

I will provide you the code to turn the .csv file into a Pandas dataframe. Your task is to summarize these data and pull out some interesting tidbits.

Information about the columns in the data:
* 'Club' = the shorthand for the soccer club. 'CHI' means Chicago, 'DAL' means Dallas, and so on. 
* 'LastName' = player's last name
* 'FirstName' = player's first name
* 'Position' = position abbreviation
    * 'M' = Middle
    * 'D' = Defense
    * 'F' = Forward
    * 'GK' = Goal Keeper
* 'BaseSalary' = Base Salary
* 'Guaranteed Compensation' = Guaranteed Compensation
* 'Year' = year

First, read in the data

In [ ]:
import pandas
df = pandas.read_csv("../data/MLS_salary_data.csv", index_col=0, encoding='utf-8')
#view our data. Note: 'NaN' indicates the value is missing
df

In [ ]:
#Exercise 2.1: Describe the data (find the count, mean, standard deviation, etc. for each numerical column)
df.describe()

In [ ]:
df['BaseSalary'].mean()

In [ ]:
# Exercise 2.2: Who makes the highest base salary over all the years?
df.sort_values('BaseSalary', ascending=False)

Exercise 2.3: Choose two different clubs to compare and use dataframe slicing methods to pull out the data for those two clubs. (You can choose the clubs. Perhaps, for example, 'CHI' vs. 'DAL')
* Compare the average salaries for the two clubs.
* Compare the maximum salary for each club.
* How many players over all the years make more than 1 million dollars for each club?

In [ ]:
# Exercise 2.3 code here
df_orl = df[df['Club']=='ORL']
df_dc = df[df['Club']=='DC']

In [ ]:
df_orl.sort_values('BaseSalary', ascending=False)

In [ ]:
df_orl['BaseSalary'].mean()

In [ ]:
df_orl['BaseSalary'].max()

In [ ]:
df_orl_mil= df_orl[df_orl['BaseSalary']>1000000]
df_orl_mil

In [ ]:
df_dc.sort_values('BaseSalary', ascending=False)

In [ ]:
df_dc['BaseSalary'].mean()

In [ ]:
df_dc['BaseSalary'].max()

In [ ]:
df_dc_mil= df_dc[df_dc['BaseSalary']>1000000]
df_dc_mil

# Part 4: Introduction to Data Visualization

We'll focus on the numerical column 'score', and think through different ways of summarizing and visualizing it.

In [ ]:
df = pandas.read_csv("../data/BDHSI2016_music_reviews.csv", sep = '\t')
df

In [ ]:
####Exercise 1: Summarize your data
df.describe()

In [ ]:
#To summarize non-numeric columns use the value_counts() function
df['genre'].value_counts()

In [ ]:
#Next: visualize it using a histogram
#This is good practice whenever working with data. Before you do anything, visualize it!
#What did we learn?
df.hist()

In [ ]:
#There are different genres in the data. Perhaps the average score is different for each genre?
#We can compare groups using the groupby() function

grouped = df.groupby('genre')
grouped

In [ ]:
#Let's compare the mean!
grouped.mean()

In [ ]:
#sort the values
grouped.mean().sort_values(by='score',ascending=False)

In [ ]:
#we can do any calculation
#it will do the same calculation on every column
grouped.max()

In [ ]:
#Visualize it!
#add the .plot() function to our calculation
grouped.mean().plot(kind='bar')

In [ ]:
#sort the values to make it easier to see
grouped.mean().sort_values(by='score',ascending=False).plot(kind='bar')

In [ ]:
#Add error bars to indicate variance
grouped.mean().sort_values(by='score',ascending=False).plot(kind='bar', yerr=grouped.std())